In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
plt.style.use("fivethirtyeight")
sns.set_style("darkgrid")

--------------------------

In [6]:
df1 = pd.read_csv("concept.tsv", delimiter='\t', header=None)
df1.head(3)

,0,1,2,3,4,5,6,7,8,9
0,0,No matching concept,Metadata,None,Undefined,NaN,No matching concept,1970-01-01,2099-12-31,NaN
1,1,Domain,Metadata,Domain,Domain,NaN,OMOP generated,1970-01-01,2099-12-31,NaN
2,2,Gender,Metadata,Domain,Domain,NaN,OMOP generated,1970-01-01,2099-12-31,NaN

In [10]:
df1.shape

(2361147, 10)

In [9]:
df2 = pd.read_csv("standard_case_drug.tsv", delimiter='\t', header=None)
df2.head(3)

             0          1           2   3         4
0  101551742.0        NaN           4   C    711584
1          NaN  4787243.0  1006505295   C  19011773
2          NaN  6751326.0  1013792507  SS  40163615

In [11]:
df2.shape

(15365394, 5)

In [12]:
df3 = pd.read_csv("standard_case_indication.tsv", delimiter='\t', header=None)
df3.head(3)

           0   1  2                                    3         4      5
0  100033011  \N  1  Product used for unknown indication  42890454     \N
1  100033061  \N  1  Product used for unknown indication  42890454     \N
2  100033001  \N  1                         Osteoporosis  36416551  80502

In [13]:
df3.shape

(8637264, 6)

In [14]:
df4 = pd.read_csv("standard_case_outcome.tsv", delimiter='\t', header=None)
df4.head(3)

    0        1               2         3       4
0  \N  8310062  EYE IRRITATION  35607122      \N
1  \N  7794268      CONVULSION  36718526  377091
2  \N  7794268         PYREXIA  35809054  437663

In [15]:
df4.shape

(15745760, 5)

In [16]:
df5 = pd.read_csv("standard_case_outcome_category.tsv", delimiter='\t', header=None)
df5.head(3)

           0        1   2        3
0  101992751       \N  \N       \N
1         \N  5508037  OT  4001594
2         \N  5940395  OT  4001594

In [17]:
df5.shape

(5700244, 4)

In [18]:
df6 = pd.read_csv("standard_drug_outcome_contingency_table.tsv", delimiter='\t', header=None)
df6.head(3)

        0         1  2       3    4         5
0  702865  35104065  1    8365  256  60658372
1  705103  35104065  1  186947  256  60479790
2  710062  35104065  5  184297  252  60482440

In [19]:
df6.shape

(3766382, 6)

In [20]:
df7 = pd.read_csv("standard_drug_outcome_count.tsv", delimiter='\t', header=None)
df7.head(3)

          0         1   2        3
0   1769535  35708310   2  4119306
1  19011773  35707684  36  4281516
2   1774470  37019455   3  4171974

In [21]:
df7.shape

(3766382, 4)

In [ ]:
df8 = pd.read_csv("standard_drug_outcome_drilldown.tsv", delimiter='\t', header=None)
df8.head(3)

In [ ]:
df8.shape

In [9]:
df9 = pd.read_csv("standard_drug_outcome_statistics.tsv", delimiter='\t', header=None)
df9.head(3)

,0,1,2,3,4,5,6,7,8,9
0,918906,35104067,432588,1,1.10027,7.82057,0.15480,1.10027,7.82080,0.15479
1,19080406,35104070,436659,1,2.60101,18.45177,0.36665,2.60230,18.49021,0.36625
2,1115572,35104074,439777,108,0.53708,0.64839,0.44488,0.53570,0.64709,0.44348

In [10]:
df9.shape

(3766382, 10)

In [7]:
df10 = pd.read_csv("standard_unique_all_case.tsv", delimiter='\t', header=None)
df10.head(3)

          0          1   2
0   9568691   95686911  \N
1   9072290   90722901  \N
2  10685148  106851481  \N

In [8]:
df10.shape

(4929388, 3)

In [5]:
df11 = pd.read_csv("vocabulary.tsv", delimiter='\t', header=None)
df11.head(3)

,0,1,2,3,4
0,ABMS,Provider Specialty (American Board of Medical ...,http://www.abms.org/member-boards/specialty-su...,NaN,45756746
1,APC,Ambulatory Payment Classification (CMS),http://www.cms.gov/Medicare/Medicare-Fee-for-S...,2011-28-09,44819132
2,ATC,WHO Anatomic Therapeutic Chemical Classification,FDB UK distribution package,RxNorm Full 20150706,44819117

In [6]:
df11.shape

(64, 5)

---------------

In [7]:
df12 = pd.read_csv("offside_socs_modified.csv", header=None)
df12.head(3)

                                                   0
0         version https://git-lfs.github.com/spec/v1
1  oid sha256:7031fccd43118550d8136d8e27d1a3cdfdb...
2                                        size 138662

In [14]:
df12[0][0]

'version https://git-lfs.github.com/spec/v1'

In [21]:
df12[0].value_counts()

version https://git-lfs.github.com/spec/v1                                     1
oid sha256:7031fccd43118550d8136d8e27d1a3cdfdbd9542e65909813c952cfe7b1886a7    1
size 138662                                                                    1
Name: 0, dtype: int64

In [8]:
df13 = pd.read_csv("offsides_socs.csv", header=None)
df13.head(3)

                                                   0
0         version https://git-lfs.github.com/spec/v1
1  oid sha256:77a863fbe2834f13c332d627eb6865fe4dd...
2                                      size 83739714

In [17]:
df13[0][0]

'version https://git-lfs.github.com/spec/v1'

In [9]:
df14 = pd.read_csv("sider.csv", header=None)
df14.head(3)

                                                   0
0         version https://git-lfs.github.com/spec/v1
1  oid sha256:71efc6ac4ca82d6545bc512509863281be0...
2                                        size 183743

In [18]:
df14[0][0]

'version https://git-lfs.github.com/spec/v1'

-----------